import pandas as pd

data = {
    "이름": ["김철수", "이영희", "박민수", "최지훈", "정소희"],
    "학년": [1, 2, 3, 4, 2],
    "학점": [4.2, 3.8, 4.5, 3.9, 3.5],
    "학과": ["컴퓨터학", "경영학", "농학", "교육학", "영어영문학"],
    "동아리": ["프로그래밍", "독서토론", "로봇공학", "봉사활동", "음악감상"]
}
df = pd.DataFrame([data])

## DataFrame 인덱스 출력
print(df.index)
#결과: RangeIndex(start=0, stop=1, step=1)


## DataFrame 컬럼 출력
print(df.columns)
#결과: Index(['이름', '학년', '학점', '학과', '동아리'], dtype='object')


## DataFrame 행 출력
print(df.values.tolist()) #파이썬의 리스트형태
#결과: [[['김철수', '이영희', '박민수', '최지훈', '정소희'], [1, 2, 3, 4, 2], [4.2, 3.8, 4.5, 3.9, 3.5], ['컴퓨터학', '경영학', '농학', '교육학', '영어영문학'], ['프로그래밍', '독서토론', '로봇공학', '봉사활동', '음악감상']]]
print(df.values) # NumPy 형태
#결과:
# [[list(['김철수', '이영희', '박민수', '최지훈', '정소희']) list([1, 2, 3, 4, 2])
#   list([4.2, 3.8, 4.5, 3.9, 3.5])
#   list(['컴퓨터학', '경영학', '농학', '교육학', '영어영문학'])
#   list(['프로그래밍', '독서토론', '로봇공학', '봉사활동', '음악감상'])]]


## DataFrame 값 출력
print(df.values.flatten()) #구조화되어 있는 것을 하나로 쭉 나열하는 것
# [list(['김철수', '이영희', '박민수', '최지훈', '정소희']) list([1, 2, 3, 4, 2])
#  list([4.2, 3.8, 4.5, 3.9, 3.5])
#  list(['컴퓨터학', '경영학', '농학', '교육학', '영어영문학'])
#  list(['프로그래밍', '독서토론', '로봇공학', '봉사활동', '음악감상'])]